In [3]:
import pandas as pd
file = "Resources/purchase_data.csv"
df = pd.read_csv(file)
df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [4]:
%%HTML
<style type="text/css">
table.dataframe td, table.dataframe th {
    border: 1px  black solid !important;
  color: black !important;
}
</style>

In [5]:
df.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   91.755128    3.050987
std     225.310896    6.659444   52.697702    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   47.750000    1.980000
50%     389.500000   22.000000   92.000000    3.150000
75%     584.250000   25.000000  138.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [6]:
df.describe(include="all")

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
count,780.000000,780,780.000000,780,780.000000,780,780.000000
unique,NaN,576,NaN,3,NaN,179,NaN
top,NaN,Lisosia93,NaN,Male,NaN,Final Critic,NaN
freq,NaN,5,NaN,652,NaN,13,NaN
mean,389.500000,NaN,22.714103,NaN,91.755128,NaN,3.050987
std,225.310896,NaN,6.659444,NaN,52.697702,NaN,1.169549
min,0.000000,NaN,7.000000,NaN,0.000000,NaN,1.000000
25%,194.750000,NaN,20.000000,NaN,47.750000,NaN,1.980000
50%,389.500000,NaN,22.000000,NaN,92.000000,NaN,3.150000
75%,584.250000,NaN,25.000000,NaN,138.000000,NaN,4.080000
max,779.000000,NaN,45.000000,NaN,183.000000,NaN,4.990000

In [20]:
df["SN"].nunique()

576

In [21]:
uniquecount = df["SN"].nunique()

In [23]:
uniquecount

576

In [26]:
count_df = pd.DataFrame([uniquecount],columns = ["Total Players"])

In [27]:
count_df

   Total Players
0            576

In [28]:
uniqueitems = df["Item Name"].nunique()

In [29]:
uniqueitems

179

In [30]:
item_df = pd.DataFrame([uniqueitems],columns = ["Number Of Unique Items"])

In [31]:
item_df

   Number Of Unique Items
0                     179

In [32]:
avg_price = df["Price"].mean()

In [33]:
avg_price

3.050987179487176

In [35]:
avg_price = round(avg_price,2)
"$"+str(avg_price)

'$3.05'

In [36]:
df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [37]:
df["Purchase ID"].count()

780

In [38]:
purchasecount = df["Purchase ID"].count()

In [39]:
purchasecount

780

In [40]:
sum = df["Price"].sum()

In [41]:
sum

2379.77

In [43]:
print(uniqueitems,avg_price,sum)

179 3.05 2379.77

In [55]:
data = [[uniqueitems,"$"+str(avg_price),purchasecount,"$"+str(sum)]]

In [56]:
data

[[179, '$3.05', 780, '$2379.77']]

In [57]:
resultdf = pd.DataFrame(data, columns=["Number Of Unique Items","Average Price","Number Of Purchases","Total Revenue"])

In [58]:
resultdf

   Number Of Unique Items Average Price  Number Of Purchases Total Revenue
0                     179         $3.05                  780      $2379.77

In [59]:
df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [72]:
x=df.groupby("SN").Gender.value_counts()

In [65]:
df["Gender"].describe()

count      780
unique       3
top       Male
freq       652
Name: Gender, dtype: object

In [73]:
type(x)

pandas.core.series.Series

In [74]:
x

SN             Gender
Adairialis76   Male      1
Adastirin33    Female    1
Aeda94         Male      1
Aela59         Male      1
Aelaria33      Male      1
                        ..
Yathecal82     Female    3
Yathedeu43     Male      2
Yoishirrala98  Female    1
Zhisrisu83     Male      2
Zontibe81      Male      3
Name: Gender, Length: 576, dtype: int64

In [75]:
df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [77]:
df.groupby("SN","Gender").value_counts()

ValueError: No axis named Gender for object type <class 'pandas.core.frame.DataFrame'>

In [79]:
new_df = df.drop_duplicates(subset = "SN")

In [80]:
new_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
773,773,Hala31,21,Male,19,"Pursuit, Cudgel of Necromancy",1.02
774,774,Jiskjask80,11,Male,92,Final Critic,4.19
775,775,Aethedru70,21,Female,60,Wolf,3.54
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19

In [83]:
new_df["Gender"].value_counts()

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [84]:
new_df = df.drop_duplicates(subset='SN')

In [85]:
new_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
773,773,Hala31,21,Male,19,"Pursuit, Cudgel of Necromancy",1.02
774,774,Jiskjask80,11,Male,92,Final Critic,4.19
775,775,Aethedru70,21,Female,60,Wolf,3.54
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19

In [86]:
new_df["Gender"].value_counts()

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [91]:
gendercounts = new_df.groupby("Gender")

In [92]:
type[gendercounts]

TypeError: 'type' object is not subscriptable

In [93]:
type(gendercounts)

pandas.core.groupby.generic.DataFrameGroupBy

In [95]:
print(gendercounts)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7feb04a5f4a8>

In [96]:
new_df.count()

Purchase ID    576
SN             576
Age            576
Gender         576
Item ID        576
Item Name      576
Price          576
dtype: int64

In [108]:
new_df["Gender"].value_counts(normalize=True).reset_index()

                   index    Gender
0                   Male  0.840278
1                 Female  0.140625
2  Other / Non-Disclosed  0.019097

In [103]:
new_df.groupby("Gender").size() /

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
dtype: int64

In [104]:
x =new_df.groupby("Gender").size()

In [105]:
type(x)

pandas.core.series.Series

In [109]:
new_df = df.drop_duplicates(subset='SN')

In [110]:
new_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
773,773,Hala31,21,Male,19,"Pursuit, Cudgel of Necromancy",1.02
774,774,Jiskjask80,11,Male,92,Final Critic,4.19
775,775,Aethedru70,21,Female,60,Wolf,3.54
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19

                                               index    Gender
0  MaleMaleMaleMaleMaleMaleMaleMaleMaleMaleMaleMa...  0.840278
1  FemaleFemaleFemaleFemaleFemaleFemaleFemaleFema...  0.140625
2  Other / Non-DisclosedOther / Non-DisclosedOthe...  0.019097

In [123]:
new_df["Gender"].value_counts(normalize=True).reset_index()

                                               index    Gender
0  MaleMaleMaleMaleMaleMaleMaleMaleMaleMaleMaleMa...  0.840278
1  FemaleFemaleFemaleFemaleFemaleFemaleFemaleFema...  0.140625
2  Other / Non-DisclosedOther / Non-DisclosedOthe...  0.019097

In [143]:
new_df = df.drop_duplicates(subset='SN')

In [144]:
count_df= new_df["Gender"].value_counts(normalize=True).reset_index()

In [145]:
count_df

                   index    Gender
0                   Male  0.840278
1                 Female  0.140625
2  Other / Non-Disclosed  0.019097

In [146]:
count_df["Percentage of Players"] = count_df["Gender"]*100

In [140]:
count_df["Percentage of Players"] = count_df["Percentage of Players"].astype(str)+"%"

In [151]:
count_df["Rounded" ] = count_df["Percentage of Players"].round(decimals=2)

In [153]:
count_df["Percentage of Players"] = count_df["Rounded"].astype(str)+"%"

In [154]:
count_df

                   index    Gender Percentage of Players  Rounded
0                   Male  0.840278                84.03%    84.03
1                 Female  0.140625                14.06%    14.06
2  Other / Non-Disclosed  0.019097                 1.91%     1.91

In [155]:
del count_df["Gender"]

In [156]:
del count_df["Rounded"]

In [157]:
count_df

                   index Percentage of Players
0                   Male                84.03%
1                 Female                14.06%
2  Other / Non-Disclosed                 1.91%

In [158]:
count_df.columns = ["Total Count" , "Percentage of Players"]

In [159]:
count_df

             Total Count Percentage of Players
0                   Male                84.03%
1                 Female                14.06%
2  Other / Non-Disclosed                 1.91%